Revit 2027 API
DuctFittingAndAccessoryConnectorData.Profile Property
 The connector profile.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConnectorProfileType Profile { get; }
Public ReadOnly Property Profile As ConnectorProfileType
	Get
public:
property ConnectorProfileType Profile {
	ConnectorProfileType get ();
}
member Profile : ConnectorProfileType with get
Property Value
ConnectorProfileType
See Also
Reference
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace